examples/couetteFlow2D/openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    movingWall
    {
        type            wall;
        nFaces          9;
        startFace       93;
        closedSolidBodyMotion false;
    }
    CPLReceiveMD
    {
        type            patch;
        nFaces          9;
        startFace       102;
    }
    streamwiseIn
    {
        type            cyclic;
        nFaces          12;
        startFace       111;
        featureCos      0.9;
    }
    front
    {
        type            empty;
        nFaces          108;
        startFace       123;
    }
)


// ************************************************************************* //
